[Killed] StringLiteral
main/components/School/SchoolsTable.js:12:20
 export default function SchoolsTable({
     schools,
     currentUser,
-    testIdPrefix = "SchoolsTable" }) {
+    testIdPrefix = "" }) {
 
     const navigate = useNavigate();
killedBy: SchoolsTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SchoolsTable-cell-row-0-col-abbrev"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] BlockStatement
main/components/School/SchoolsTable.js:16:36
 
     const navigate = useNavigate();
 
-    const editCallback = (cell) => {
-        navigate(`/schools/edit/${cell.row.values.abbrev}`)
-    }
+    const editCallback = (cell) => {}
 
     // Stryker disable all : hard to test for query caching
killedBy: SchoolsTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/schools/edit/ucsb"

Number of calls: 0

<html>
  <head />

[Killed] ObjectLiteral
main/components/School/SchoolsTable.js:33:9
     const deleteCallback = async (cell) => { deleteMutation.mutate(cell); }
 
     const columns = [
-        {
-            Header: 'Abbreviation',
-            accessor: 'abbrev',
-        },
+        {},
         {
             Header: 'Name',
killedBy: SchoolsTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/School/SchoolsTable.js:35:23
     const columns = [
         {
             Header: 'Abbreviation',
-            accessor: 'abbrev',
+            accessor: "",
         },
         {
killedBy: SchoolsTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SchoolsTable-cell-row-0-col-abbrev"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"
