[Killed] BlockStatement
src/main/utils/schoolUtils.js:8:47
     toast(message);
 }
 
-export function cellToAxiosParamsDelete(cell) {
-    return {
-        url: "/api/schools",
-        method: "DELETE",
-        params: {
-            id: cell.row.values.abbrev
-        }
-    }
-}
+export function cellToAxiosParamsDelete(cell) {}
 
killedBy: schoolUtils cellToAxiosParamsDelete It returns the correct params
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"method": "DELETE", "params": {"id": "ucsb"}, "url": "/api/schools"}
Received: undefined
