[Killed] ObjectLiteral
main/components/Courses/CoursesTable.js:45:10
              Header: 'Term',
              accessor: 'term',
          },
-         {
-             Header: 'Start',
-             accessor: 'start',
-         },
+         {},
          {
              Header: 'End',
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: A column ID (or string accessor) is required!
