[Killed] StringLiteral
src/main/pages/CoursesEditPage.js:17:14
       [`/api/courses?id=${id}`],
       {  // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
         method: "GET",
-        url: `/api/courses`,
+        url: ``,
         params: {
           id
killedBy: CoursesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="CoursesForm-name"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrowFunction
src/main/pages/CoursesEditPage.js:25:34
     );
 
 
-  const objectToAxiosPutParams = (course) => ({
-    url: "/api/courses",
-    method: "PUT",
-    params: {
-      id: course.id,
-    },
-    data: {
-      name: course.name,
-      school: course.school,
-      term: course.term,
-      startDate: course.startDate,
-      endDate: course.endDate,
-      githubOrg: course.githubOrg
-    }
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (course) => {
killedBy: CoursesEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>
