[Killed] StringLiteral
main/components/Courses/CoursesForm.js:104:42
                             id="start"
                             type="datetime-local"
                             isInvalid={Boolean(errors.start)}
-                            {...register("start", { required: true, pattern: isodate_regex })}
+                            {...register("", { required: true, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: CoursesForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] LogicalOperator
main/components/Courses/CoursesForm.js:107:30
                             {...register("start", { required: true, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.start && 'Start date is required. '}
+                            {errors.start || 'Start date is required. '}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: CoursesForm tests Correct Error messsages on missing input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/components/Courses/CoursesForm.js:107:30
                             {...register("start", { required: true, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.start && 'Start date is required. '}
+                            {true}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: CoursesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Start date is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/Courses/CoursesForm.js:119:42
                             id="end"
                             type="datetime-local"
                             isInvalid={Boolean(errors.end)}
-                            {...register("end", { required: true, pattern: isodate_regex })}
+                            {...register("", { required: true, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: CoursesForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] LogicalOperator
main/components/Courses/CoursesForm.js:122:30
                             {...register("end", { required: true, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.end && 'End date is required. '}
+                            {errors.end || 'End date is required. '}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: CoursesForm tests Correct Error messsages on missing input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/components/Courses/CoursesForm.js:122:30
                             {...register("end", { required: true, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.end && 'End date is required. '}
+                            {true}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: CoursesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /End date is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
